use pz1::decipher_vigenere;

// variant 17
// 17 % 3 == 2

const CIPHERTEXT: &str = "Вцмвриґсб клйд, у сиьб ґатсчстизшюх \
вьізтинщзтеш ізимсажичясй \
крхьиоаькериґчяв є яіторач уиплмвовхг \
тіт, іщ де мцяиятї тдфовчсціч ьжо \
вьізнищі, иомд йян нс чеже гціжиґс \
ьасаїем адачнтхвякажта. Ця ніца сґіга \
пвслиназ єоянс яєрлюйічяща сигачми \
гнжтиетваццу уідщюютиє хгючцй.";

const KEY: &str = "аліса";

fn main() {
    let plaintext = decipher_vigenere(CIPHERTEXT, KEY);
    println!("{plaintext}");
}
